Repository: j-fudali/drawing-trainer
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Drawing Trainer
pl: Trener rysunku

source: Trainer
pl: Trener

source: History
pl: Historia

source: Generate
pl: Generuj

# generateText
source: Prepare pencil and paper to draw
pl: Przygotuj ołówek i papier

# generatedObjectText
source: Generated object is:
pl: Wygenerowany obiekt to:

source: Start drawing
pl: Zacznij rysować

source: Restart
pl: Ponów

# historyUpperTextCorrect
source: This is a drawing of
pl: To jest rysunek obiektu

# historyUpperTextWrong
source: This is not a drawing of
pl: To jest nie rysunek obiektu

# generateObjectPrompt
source: Return a one random object from world that can be drawn. It can be anything. Response in english.
pl: Wylosuj dowolony jeden obiekt rzeczywisty, któy można narysować. Podaj samą nazwę.

# resultsPrompt
source: Return JSON object where: "isValid" contains true or false, if image shows a drawing of {generatedObject}, "rate" containing rate from 0 to 100 of quality of drawing, "tips" containing array of up to 3 tips that author of drawing can improve in this drawing. Example of returned object: '{"isValid":true, "rate": 60, "tips": ["text...", "text..", "text.."]}'
pl: Zwróć obiekt JSON gdzie: "isValid" zawiera true lub false, jeżeli zdjęcie pokazuje rysunek przedstawiający {generatedObject}, "rate" zawierający ocenę w skali od 0 do 100 pod względem jakości rysunku, "tips" zawiera tablicę(array) maksymalnie 3 podpowiedzi, które autor rysunku może zastosować, aby rysunek był lepszy. Przykład zwracanego obiektu: '{"isValid":true, "rate": 60, "tips": ["text...", "text..", "text.."]}'

# noHistory
source: No history yet
pl: Brak historii

# error
source: Something went wrong
pl: Coś poszło nie tak
